# Copyright (c) 2015-2018 in2H2 inc.
# System developed for in2H2 inc. by Intermotion Technology, Inc.
#
# Full system RTL, C sources and board design files available at https://github.com/nearist
#
# in2H2 inc. Team Members:
# - Chris McCormick - Algorithm Research and Design
# - Matt McCormick - Board Production, System Q/A
#
# Intermotion Technology Inc. Team Members:
# - Mick Fandrich - Project Lead
# - Dr. Ludovico Minati - Board Architecture and Design, FPGA Technology Advisor
# - Vardan Movsisyan - RTL Team Lead
# - Khachatur Gyozalyan - RTL Design
# - Tigran Papazyan - RTL Design
# - Taron Harutyunyan - RTL Design
# - Hayk Ghaltaghchyan - System Software
#
# Tecno77 S.r.l. Team Members:
# - Stefano Aldrigo, Board Layout Design
#
# We dedicate this project to the memory of Bruce McCormick, an AI pioneer
# and advocate, a good friend and father.
#
# These materials are provided free of charge: you can redistribute them and/or modify
# them under the terms of the GNU General Public License as published by
# the Free Software Foundation, version 3.
#
# These materials are distributed in the hope that they will be useful, but
# WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
# General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with this program. If not, see <http://www.gnu.org/licenses/>.

set_property -dict {PACKAGE_PIN R17 IOSTANDARD LVCMOS18} [get_ports pcie_perst_ls]
set_false_path -from [get_ports pcie_perst_ls]
set_false_path -to [get_pins -hier -filter name=~*/pipe_clock/pclk_i1_bufgctrl.pclk_i1/S0]
set_false_path -to [get_pins -hier -filter name=~*/pipe_clock/pclk_i1_bufgctrl.pclk_i1/S1]
set_case_analysis 1 [get_pins -hier -filter name=~*/pipe_clock/pclk_i1_bufgctrl.pclk_i1/S0]
set_case_analysis 0 [get_pins -hier -filter name=~*/pipe_clock/pclk_i1_bufgctrl.pclk_i1/S1]
create_clock -period 10.000 -name pcie_refclk_p [get_ports pcie_refclk_p]
#set_property slave_banks {32 34} [get_iobanks 33]

set_property LOC IBUFDS_GTE2_X0Y2 [get_cells -match_style ucf */pcieclk_ibuf]

#set_false_path -to  [get_pins -match_style ucf */pipe_clock/pclk_i1_bufgctrl.pclk_i1/S0]
#set_false_path -to  [get_pins -match_style ucf */pipe_clock/pclk_i1_bufgctrl.pclk_i1/S1]
#set_case_analysis 1 [get_pins -match_style ucf */pipe_clock/pclk_i1_bufgctrl.pclk_i1/S0]
#set_case_analysis 0 [get_pins -match_style ucf */pipe_clock/pclk_i1_bufgctrl.pclk_i1/S1]

#set_property DONT_TOUCH true [get_cells -of [get_nets -of [get_pins -match_style ucf */pipe_clock/pclk_i1_bufgctrl.pclk_i1/S0]]]
#set_property DONT_TOUCH true [get_cells -hier -filter name=~*/pipe_clock/pclk_sel*]

set_property DONT_TOUCH true [get_cells -of [get_nets -of [get_pins -hier -filter name=~*/pipe_clock/pclk_i1_bufgctrl.pclk_i1/S0]]]
set_property DONT_TOUCH true [get_cells -hier -filter name=~*/pipe_clock/pclk_sel*]

#set_property CONFIG_MODE BPI16 [current_design]
#set_property CONFIG_VOLTAGE 1.8 [current_design]
#set_property CFGBVS GND [current_design]
#set_property BITSTREAM.CONFIG.EXTMASTERCCLK_EN DIV-1 [current_design]
#set_property BITSTREAM.CONFIG.BPI_SYNC_MODE TYPE2 [current_design]
#set_property BITSTREAM.CONFIG.UNUSEDPIN PULLNONE [current_design]

## System clock input 200 mHz
#set_property -dict {PACKAGE_PIN H21}  [get_ports sys_clk_p]
#set_property -dict {PACKAGE_PIN H22}  [get_ports sys_clk_n]
#set_property  IOSTANDARD DIFF_SSTL135 [get_ports sys_clk_p]
#set_property  IOSTANDARD DIFF_SSTL135 [get_ports sys_clk_n]
#create_clock -period 5.000 -name sys_clk_p [get_ports sys_clk_p]
#set_property        PACKAGE_PIN P16   [get_ports {sys_clk_sd}]
#set_property IOSTANDARD  LVCMOS18     [get_ports {sys_clk_sd}]

set_false_path -from [get_cells artix_core_sdr_diff_0/parallel_if_sdr_diff_lane_0/downstream_en_reg_int_reg] -to [get_cells artix_core_sdr_diff_0/parallel_if_sdr_diff_lane_0/downstream_en_reg_ext_1_reg]
set_false_path -from [get_cells artix_core_sdr_diff_0/parallel_if_sdr_diff_lane_1/downstream_en_reg_int_reg] -to [get_cells artix_core_sdr_diff_0/parallel_if_sdr_diff_lane_1/downstream_en_reg_ext_1_reg]
set_false_path -from [get_cells artix_core_sdr_diff_0/parallel_if_sdr_diff_lane_2/downstream_en_reg_int_reg] -to [get_cells artix_core_sdr_diff_0/parallel_if_sdr_diff_lane_2/downstream_en_reg_ext_1_reg]
#set_property C_CLK_INPUT_FREQ_HZ 300000000 [get_debug_cores dbg_hub]
#set_property C_ENABLE_CLK_DIVIDER false [get_debug_cores dbg_hub]
#set_property C_USER_SCAN_CHAIN 1 [get_debug_cores dbg_hub]
#connect_debug_port dbg_hub/clk [get_nets parallel_if_sdr_diff_lane_2/sdr_clk_in]
create_clock -period 20.000 -name clk_parallel [get_nets artix_core_sdr_diff_0/clk_par_if]

# Reference clock input 200 mHz
set_property -dict {PACKAGE_PIN J23} [get_ports clk_ref_p]
set_property -dict {PACKAGE_PIN H23} [get_ports clk_ref_n]
set_property IOSTANDARD DIFF_SSTL135 [get_ports clk_ref_p]
set_property IOSTANDARD DIFF_SSTL135 [get_ports clk_ref_n]

create_clock -period 20.000 -name lane0_sdr_clk_rl_p_i [get_ports lane0_sdr_clk_rl_p_i]
create_clock -period 20.000 -name lane1_sdr_clk_rl_p_i [get_ports lane1_sdr_clk_rl_p_i]
create_clock -period 20.000 -name lane2_sdr_clk_rl_p_i [get_ports lane2_sdr_clk_rl_p_i]

# Parallel interface signals for Lane 0
set_property PACKAGE_PIN U21  [get_ports lane0_sdr_clk_lr_p_o]
set_property PACKAGE_PIN V21  [get_ports lane0_sdr_clk_lr_n_o]
set_property PACKAGE_PIN U22  [get_ports lane0_sdr_clk_rl_p_i]
set_property PACKAGE_PIN V22  [get_ports lane0_sdr_clk_rl_n_i]
set_property PACKAGE_PIN AA22 [get_ports {lane0_sdr_data_p_io[0]}]
set_property PACKAGE_PIN AA23 [get_ports {lane0_sdr_data_n_io[0]}]
set_property PACKAGE_PIN V26  [get_ports {lane0_sdr_data_p_io[1]}]
set_property PACKAGE_PIN W26  [get_ports {lane0_sdr_data_n_io[1]}]
set_property PACKAGE_PIN Y22  [get_ports {lane0_sdr_data_p_io[2]}]
set_property PACKAGE_PIN Y23  [get_ports {lane0_sdr_data_n_io[2]}]
set_property PACKAGE_PIN AA24 [get_ports {lane0_sdr_data_p_io[3]}]
set_property PACKAGE_PIN AB25 [get_ports {lane0_sdr_data_n_io[3]}]
set_property PACKAGE_PIN AB24 [get_ports {lane0_sdr_data_p_io[4]}]
set_property PACKAGE_PIN AC24 [get_ports {lane0_sdr_data_n_io[4]}]
set_property PACKAGE_PIN Y25  [get_ports {lane0_sdr_data_p_io[5]}]
set_property PACKAGE_PIN AA25 [get_ports {lane0_sdr_data_n_io[5]}]
set_property PACKAGE_PIN W25  [get_ports {lane0_sdr_data_p_io[6]}]
set_property PACKAGE_PIN Y26  [get_ports {lane0_sdr_data_n_io[6]}]
set_property PACKAGE_PIN V23  [get_ports {lane0_sdr_data_p_io[7]}]
set_property PACKAGE_PIN W23  [get_ports {lane0_sdr_data_n_io[7]}]
set_property PACKAGE_PIN AB26 [get_ports {lane0_sdr_data_type_p_io[0]}]
set_property PACKAGE_PIN AC26 [get_ports {lane0_sdr_data_type_n_io[0]}]
set_property PACKAGE_PIN U25  [get_ports {lane0_sdr_data_type_p_io[1]}]
set_property PACKAGE_PIN U26  [get_ports {lane0_sdr_data_type_n_io[1]}]
set_property PACKAGE_PIN Y21  [get_ports lane0_sdr_dir_o]
set_property PACKAGE_PIN W21  [get_ports lane0_has_data_i]
set_property PACKAGE_PIN T20  [get_ports lane0_ready_io]

set_property IOSTANDARD DIFF_SSTL135 [get_ports lane0_sdr_clk_lr_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports lane0_sdr_clk_lr_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports lane0_sdr_clk_rl_p_i]
set_property IOSTANDARD DIFF_SSTL135 [get_ports lane0_sdr_clk_rl_n_i]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_p_io[0]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_n_io[0]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_p_io[1]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_n_io[1]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_p_io[2]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_n_io[2]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_p_io[3]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_n_io[3]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_p_io[4]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_n_io[4]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_p_io[5]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_n_io[5]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_p_io[6]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_n_io[6]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_p_io[7]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_n_io[7]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_type_p_io[0]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_type_n_io[0]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_type_p_io[1]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane0_sdr_data_type_n_io[1]}]
set_property IOSTANDARD SSTL135 [get_ports lane0_sdr_dir_o]
set_property IOSTANDARD SSTL135 [get_ports lane0_has_data_i]
set_property IOSTANDARD SSTL135 [get_ports lane0_ready_io]

set_property SLEW FAST [get_ports lane0_sdr_clk_lr_p_o]
set_property SLEW FAST [get_ports lane0_sdr_clk_lr_n_o]
set_property SLEW FAST [get_ports {lane0_sdr_data_p_io[0]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_n_io[0]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_p_io[1]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_n_io[1]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_p_io[2]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_n_io[2]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_p_io[3]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_n_io[3]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_p_io[4]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_n_io[4]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_p_io[5]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_n_io[5]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_p_io[6]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_n_io[6]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_p_io[7]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_n_io[7]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_type_p_io[0]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_type_n_io[0]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_type_p_io[1]}]
set_property SLEW FAST [get_ports {lane0_sdr_data_type_n_io[1]}]
set_property SLEW FAST [get_ports lane0_sdr_dir_o]
set_property SLEW FAST [get_ports lane0_ready_io]

#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports lane0_sdr_clk_rl_p_i]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports lane0_sdr_clk_rl_n_i]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_p_io[0]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_n_io[0]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_p_io[1]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_n_io[1]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_p_io[2]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_n_io[2]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_p_io[3]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_n_io[3]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_p_io[4]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_n_io[4]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_p_io[5]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_n_io[5]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_p_io[6]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_n_io[6]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_p_io[7]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_n_io[7]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_type_p_io[0]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_type_n_io[0]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_type_p_io[1]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane0_sdr_data_type_n_io[1]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports lane0_has_data_i]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports lane0_ready_io]

# Parallel interface signals for Lane 1
set_property PACKAGE_PIN N3 [get_ports lane1_sdr_clk_lr_p_o]
set_property PACKAGE_PIN N2 [get_ports lane1_sdr_clk_lr_n_o]
set_property PACKAGE_PIN R3 [get_ports lane1_sdr_clk_rl_p_i]
set_property PACKAGE_PIN P3 [get_ports lane1_sdr_clk_rl_n_i]
set_property PACKAGE_PIN K1 [get_ports {lane1_sdr_data_p_io[0]}]
set_property PACKAGE_PIN J1 [get_ports {lane1_sdr_data_n_io[0]}]
set_property PACKAGE_PIN N1 [get_ports {lane1_sdr_data_p_io[1]}]
set_property PACKAGE_PIN M1 [get_ports {lane1_sdr_data_n_io[1]}]
set_property PACKAGE_PIN M7 [get_ports {lane1_sdr_data_p_io[2]}]
set_property PACKAGE_PIN L7 [get_ports {lane1_sdr_data_n_io[2]}]
set_property PACKAGE_PIN M2 [get_ports {lane1_sdr_data_p_io[3]}]
set_property PACKAGE_PIN L2 [get_ports {lane1_sdr_data_n_io[3]}]
set_property PACKAGE_PIN H2 [get_ports {lane1_sdr_data_p_io[4]}]
set_property PACKAGE_PIN H1 [get_ports {lane1_sdr_data_n_io[4]}]
set_property PACKAGE_PIN M4 [get_ports {lane1_sdr_data_p_io[5]}]
set_property PACKAGE_PIN L4 [get_ports {lane1_sdr_data_n_io[5]}]
set_property PACKAGE_PIN L5 [get_ports {lane1_sdr_data_p_io[6]}]
set_property PACKAGE_PIN K5 [get_ports {lane1_sdr_data_n_io[6]}]
set_property PACKAGE_PIN K3 [get_ports {lane1_sdr_data_p_io[7]}]
set_property PACKAGE_PIN J3 [get_ports {lane1_sdr_data_n_io[7]}]
set_property PACKAGE_PIN L3 [get_ports {lane1_sdr_data_type_p_io[0]}]
set_property PACKAGE_PIN K2 [get_ports {lane1_sdr_data_type_n_io[0]}]
set_property PACKAGE_PIN N7 [get_ports {lane1_sdr_data_type_p_io[1]}]
set_property PACKAGE_PIN N6 [get_ports {lane1_sdr_data_type_n_io[1]}]
set_property PACKAGE_PIN R1 [get_ports lane1_sdr_dir_o]
set_property PACKAGE_PIN P4 [get_ports lane1_has_data_i]
set_property PACKAGE_PIN N4 [get_ports lane1_ready_io]

set_property IOSTANDARD DIFF_SSTL135 [get_ports lane1_sdr_clk_lr_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports lane1_sdr_clk_lr_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports lane1_sdr_clk_rl_p_i]
set_property IOSTANDARD DIFF_SSTL135 [get_ports lane1_sdr_clk_rl_n_i]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_p_io[0]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_n_io[0]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_p_io[1]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_n_io[1]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_p_io[2]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_n_io[2]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_p_io[3]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_n_io[3]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_p_io[4]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_n_io[4]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_p_io[5]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_n_io[5]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_p_io[6]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_n_io[6]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_p_io[7]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_n_io[7]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_type_p_io[0]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_type_n_io[0]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_type_p_io[1]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane1_sdr_data_type_n_io[1]}]
set_property IOSTANDARD SSTL135 [get_ports lane1_sdr_dir_o]
set_property IOSTANDARD SSTL135 [get_ports lane1_has_data_i]
set_property IOSTANDARD SSTL135 [get_ports lane1_ready_io]

set_property SLEW FAST [get_ports lane1_sdr_clk_lr_p_o]
set_property SLEW FAST [get_ports lane1_sdr_clk_lr_n_o]
set_property SLEW FAST [get_ports {lane1_sdr_data_p_io[0]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_n_io[0]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_p_io[1]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_n_io[1]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_p_io[2]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_n_io[2]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_p_io[3]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_n_io[3]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_p_io[4]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_n_io[4]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_p_io[5]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_n_io[5]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_p_io[6]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_n_io[6]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_p_io[7]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_n_io[7]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_type_p_io[0]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_type_n_io[0]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_type_p_io[1]}]
set_property SLEW FAST [get_ports {lane1_sdr_data_type_n_io[1]}]
set_property SLEW FAST [get_ports lane1_sdr_dir_o]
set_property SLEW FAST [get_ports lane1_ready_io]

#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports lane1_sdr_clk_rl_p_i]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports lane1_sdr_clk_rl_n_i]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_p_io[0]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_n_io[0]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_p_io[1]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_n_io[1]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_p_io[2]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_n_io[2]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_p_io[3]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_n_io[3]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_p_io[4]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_n_io[4]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_p_io[5]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_n_io[5]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_p_io[6]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_n_io[6]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_p_io[7]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_n_io[7]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_type_p_io[0]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_type_n_io[0]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_type_p_io[1]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane1_sdr_data_type_n_io[1]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports lane1_has_data_i]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports lane1_ready_io]

# Parallel interface signals for Lane 2
set_property PACKAGE_PIN E5 [get_ports lane2_sdr_clk_lr_p_o]
set_property PACKAGE_PIN D5 [get_ports lane2_sdr_clk_lr_n_o]
set_property PACKAGE_PIN G5 [get_ports lane2_sdr_clk_rl_p_i]
set_property PACKAGE_PIN F5 [get_ports lane2_sdr_clk_rl_n_i]
set_property PACKAGE_PIN H8 [get_ports {lane2_sdr_data_p_io[0]}]
set_property PACKAGE_PIN G8 [get_ports {lane2_sdr_data_n_io[0]}]
set_property PACKAGE_PIN E6 [get_ports {lane2_sdr_data_p_io[1]}]
set_property PACKAGE_PIN D6 [get_ports {lane2_sdr_data_n_io[1]}]
set_property PACKAGE_PIN F8 [get_ports {lane2_sdr_data_p_io[2]}]
set_property PACKAGE_PIN F7 [get_ports {lane2_sdr_data_n_io[2]}]
set_property PACKAGE_PIN J6 [get_ports {lane2_sdr_data_p_io[3]}]
set_property PACKAGE_PIN J5 [get_ports {lane2_sdr_data_n_io[3]}]
set_property PACKAGE_PIN K7 [get_ports {lane2_sdr_data_p_io[4]}]
set_property PACKAGE_PIN K6 [get_ports {lane2_sdr_data_n_io[4]}]
set_property PACKAGE_PIN G4 [get_ports {lane2_sdr_data_p_io[5]}]
set_property PACKAGE_PIN F4 [get_ports {lane2_sdr_data_n_io[5]}]
set_property PACKAGE_PIN J4 [get_ports {lane2_sdr_data_p_io[6]}]
set_property PACKAGE_PIN H4 [get_ports {lane2_sdr_data_n_io[6]}]
set_property PACKAGE_PIN H7 [get_ports {lane2_sdr_data_p_io[7]}]
set_property PACKAGE_PIN G7 [get_ports {lane2_sdr_data_n_io[7]}]
set_property PACKAGE_PIN H6 [get_ports {lane2_sdr_data_type_p_io[0]}]
set_property PACKAGE_PIN G6 [get_ports {lane2_sdr_data_type_n_io[0]}]
set_property PACKAGE_PIN L8 [get_ports {lane2_sdr_data_type_p_io[1]}]
set_property PACKAGE_PIN K8 [get_ports {lane2_sdr_data_type_n_io[1]}]
set_property PACKAGE_PIN D4 [get_ports lane2_sdr_dir_o]
set_property PACKAGE_PIN C4 [get_ports lane2_has_data_i]
set_property PACKAGE_PIN B5 [get_ports lane2_ready_io]

set_property IOSTANDARD DIFF_SSTL135 [get_ports lane2_sdr_clk_lr_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports lane2_sdr_clk_lr_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports lane2_sdr_clk_rl_p_i]
set_property IOSTANDARD DIFF_SSTL135 [get_ports lane2_sdr_clk_rl_n_i]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_p_io[0]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_n_io[0]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_p_io[1]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_n_io[1]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_p_io[2]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_n_io[2]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_p_io[3]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_n_io[3]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_p_io[4]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_n_io[4]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_p_io[5]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_n_io[5]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_p_io[6]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_n_io[6]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_p_io[7]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_n_io[7]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_type_p_io[0]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_type_n_io[0]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_type_p_io[1]}]
set_property IOSTANDARD DIFF_SSTL135 [get_ports {lane2_sdr_data_type_n_io[1]}]
set_property IOSTANDARD SSTL135 [get_ports lane2_sdr_dir_o]
set_property IOSTANDARD SSTL135 [get_ports lane2_has_data_i]
set_property IOSTANDARD SSTL135 [get_ports lane2_ready_io]

set_property SLEW FAST [get_ports lane2_sdr_clk_lr_p_o]
set_property SLEW FAST [get_ports lane2_sdr_clk_lr_n_o]
set_property SLEW FAST [get_ports {lane2_sdr_data_p_io[0]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_n_io[0]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_p_io[1]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_n_io[1]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_p_io[2]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_n_io[2]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_p_io[3]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_n_io[3]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_p_io[4]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_n_io[4]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_p_io[5]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_n_io[5]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_p_io[6]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_n_io[6]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_p_io[7]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_n_io[7]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_type_p_io[0]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_type_n_io[0]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_type_p_io[1]}]
set_property SLEW FAST [get_ports {lane2_sdr_data_type_n_io[1]}]
set_property SLEW FAST [get_ports lane2_sdr_dir_o]
set_property SLEW FAST [get_ports lane2_ready_io]

#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports lane2_sdr_clk_rl_p_i]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports lane2_sdr_clk_rl_n_i]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_p_io[0]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_n_io[0]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_p_io[1]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_n_io[1]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_p_io[2]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_n_io[2]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_p_io[3]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_n_io[3]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_p_io[4]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_n_io[4]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_p_io[5]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_n_io[5]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_p_io[6]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_n_io[6]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_p_io[7]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_n_io[7]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_type_p_io[0]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_type_n_io[0]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_type_p_io[1]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports {lane2_sdr_data_type_n_io[1]}]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports lane2_has_data_i]
#set_property IN_TERM UNTUNED_SPLIT_60 [get_ports lane2_ready_io]

# 21 defferential clock outputs for all ECP5
set_property PACKAGE_PIN W20 [get_ports cm0_clk_p_o]
set_property PACKAGE_PIN Y20 [get_ports cm0_clk_n_o]
set_property PACKAGE_PIN V19 [get_ports cm1_clk_p_o]
set_property PACKAGE_PIN W19 [get_ports cm1_clk_n_o]
set_property PACKAGE_PIN T17 [get_ports cm2_clk_p_o]
set_property PACKAGE_PIN T18 [get_ports cm2_clk_n_o]
set_property PACKAGE_PIN T19 [get_ports cm3_clk_p_o]
set_property PACKAGE_PIN U19 [get_ports cm3_clk_n_o]
set_property PACKAGE_PIN T14 [get_ports cm4_clk_p_o]
set_property PACKAGE_PIN T15 [get_ports cm4_clk_n_o]
set_property PACKAGE_PIN U15 [get_ports cm5_clk_p_o]
set_property PACKAGE_PIN U16 [get_ports cm5_clk_n_o]
set_property PACKAGE_PIN U14 [get_ports cm6_clk_p_o]
set_property PACKAGE_PIN V14 [get_ports cm6_clk_n_o]
set_property PACKAGE_PIN U6  [get_ports cm7_clk_p_o]
set_property PACKAGE_PIN U5  [get_ports cm7_clk_n_o]
set_property PACKAGE_PIN U2  [get_ports cm8_clk_p_o]
set_property PACKAGE_PIN U1  [get_ports cm8_clk_n_o]
set_property PACKAGE_PIN T2  [get_ports cm9_clk_p_o]
set_property PACKAGE_PIN R2  [get_ports cm9_clk_n_o]
set_property PACKAGE_PIN T5  [get_ports cm10_clk_p_o]
set_property PACKAGE_PIN R5  [get_ports cm10_clk_n_o]
set_property PACKAGE_PIN R8  [get_ports cm11_clk_p_o]
set_property PACKAGE_PIN P8  [get_ports cm11_clk_n_o]
set_property PACKAGE_PIN T4  [get_ports cm12_clk_p_o]
set_property PACKAGE_PIN T3  [get_ports cm12_clk_n_o]
set_property PACKAGE_PIN R7  [get_ports cm13_clk_p_o]
set_property PACKAGE_PIN R6  [get_ports cm13_clk_n_o]
set_property PACKAGE_PIN D3  [get_ports cm14_clk_p_o]
set_property PACKAGE_PIN C3  [get_ports cm14_clk_n_o]
set_property PACKAGE_PIN A3  [get_ports cm15_clk_p_o]
set_property PACKAGE_PIN A2  [get_ports cm15_clk_n_o]
set_property PACKAGE_PIN B4  [get_ports cm16_clk_p_o]
set_property PACKAGE_PIN A4  [get_ports cm16_clk_n_o]
set_property PACKAGE_PIN C1  [get_ports cm17_clk_p_o]
set_property PACKAGE_PIN B1  [get_ports cm17_clk_n_o]
set_property PACKAGE_PIN F3  [get_ports cm18_clk_p_o]
set_property PACKAGE_PIN E3  [get_ports cm18_clk_n_o]
set_property PACKAGE_PIN F2  [get_ports cm19_clk_p_o]
set_property PACKAGE_PIN E2  [get_ports cm19_clk_n_o]
set_property PACKAGE_PIN E1  [get_ports cm20_clk_p_o]
set_property PACKAGE_PIN D1  [get_ports cm20_clk_n_o]

set_property IOSTANDARD DIFF_SSTL135 [get_ports cm0_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm0_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm1_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm1_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm2_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm2_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm3_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm3_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm4_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm4_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm5_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm5_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm6_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm6_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm7_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm7_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm8_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm8_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm9_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm9_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm10_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm10_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm11_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm11_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm12_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm12_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm13_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm13_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm14_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm14_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm15_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm15_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm16_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm16_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm17_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm17_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm18_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm18_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm19_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm19_clk_n_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm20_clk_p_o]
set_property IOSTANDARD DIFF_SSTL135 [get_ports cm20_clk_n_o]

# Led Outputs
set_property PACKAGE_PIN M19 [get_ports led0_red_o]
set_property PACKAGE_PIN R18 [get_ports led0_green_o]
set_property PACKAGE_PIN P15 [get_ports led0_blue_o]

set_property IOSTANDARD LVCMOS18 [get_ports led0_red_o]
set_property IOSTANDARD LVCMOS18 [get_ports led0_green_o]
set_property IOSTANDARD LVCMOS18 [get_ports led0_blue_o]

# cfg SPI for LANE 0
set_property PACKAGE_PIN T22 [get_ports cfg0_sck0_ls_o]
set_property PACKAGE_PIN H26 [get_ports cfg0_sck1_ls_o]
set_property PACKAGE_PIN D26 [get_ports cfg0_sck2_ls_o]
set_property PACKAGE_PIN E26 [get_ports cfg0_sck3_ls_o]
set_property PACKAGE_PIN D25 [get_ports cfg0_sck4_ls_o]
set_property PACKAGE_PIN E25 [get_ports cfg0_sck5_ls_o]
set_property PACKAGE_PIN F24 [get_ports cfg0_sck6_ls_o]
set_property PACKAGE_PIN R21 [get_ports cfg0_miso_ls_i]
set_property PACKAGE_PIN R20 [get_ports cfg0_mosi_ls_o]
set_property PACKAGE_PIN P24 [get_ports cfg0_cs0n_ls_o]
set_property PACKAGE_PIN P26 [get_ports cfg0_cs1n_ls_o]
set_property PACKAGE_PIN P25 [get_ports cfg0_cs2n_ls_o]
set_property PACKAGE_PIN R26 [get_ports cfg0_cs3n_ls_o]
set_property PACKAGE_PIN T25 [get_ports cfg0_cs4n_ls_o]
set_property PACKAGE_PIN T24 [get_ports cfg0_cs5n_ls_o]
set_property PACKAGE_PIN T23 [get_ports cfg0_cs6n_ls_o]
set_property PACKAGE_PIN R25 [get_ports cfg0_cs_dir_o]
set_property PACKAGE_PIN P19 [get_ports cfg0_programn_ls_o]

set_property IOSTANDARD LVCMOS18 [get_ports cfg0_sck0_ls_o]
set_property IOSTANDARD SSTL135  [get_ports cfg0_sck1_ls_o]
set_property IOSTANDARD SSTL135  [get_ports cfg0_sck2_ls_o]
set_property IOSTANDARD SSTL135  [get_ports cfg0_sck3_ls_o]
set_property IOSTANDARD SSTL135  [get_ports cfg0_sck4_ls_o]
set_property IOSTANDARD SSTL135  [get_ports cfg0_sck5_ls_o]
set_property IOSTANDARD SSTL135  [get_ports cfg0_sck6_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg0_miso_ls_i]
set_property IOSTANDARD LVCMOS18 [get_ports cfg0_mosi_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg0_cs0n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg0_cs1n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg0_cs2n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg0_cs3n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg0_cs4n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg0_cs5n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg0_cs6n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg0_cs_dir_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg0_programn_ls_o]


# cfg SPI for LANE 1
set_property PACKAGE_PIN K26 [get_ports cfg1_sck0_ls_o]
set_property PACKAGE_PIN U17 [get_ports cfg1_sck1_ls_o]
set_property PACKAGE_PIN V17 [get_ports cfg1_sck2_ls_o]
set_property PACKAGE_PIN V16 [get_ports cfg1_sck3_ls_o]
set_property PACKAGE_PIN V18 [get_ports cfg1_sck4_ls_o]
set_property PACKAGE_PIN U20 [get_ports cfg1_sck5_ls_o]
set_property PACKAGE_PIN V24 [get_ports cfg1_sck6_ls_o]
set_property PACKAGE_PIN L25 [get_ports cfg1_miso_ls_i]
set_property PACKAGE_PIN K25 [get_ports cfg1_mosi_ls_o]
set_property PACKAGE_PIN M26 [get_ports cfg1_cs0n_ls_o]
set_property PACKAGE_PIN M25 [get_ports cfg1_cs1n_ls_o]
set_property PACKAGE_PIN N26 [get_ports cfg1_cs2n_ls_o]
set_property PACKAGE_PIN N24 [get_ports cfg1_cs3n_ls_o]
set_property PACKAGE_PIN L24 [get_ports cfg1_cs4n_ls_o]
set_property PACKAGE_PIN M22 [get_ports cfg1_cs5n_ls_o]
set_property PACKAGE_PIN N23 [get_ports cfg1_cs6n_ls_o]
set_property PACKAGE_PIN P20 [get_ports cfg1_cs_dir_o]
set_property PACKAGE_PIN M24 [get_ports cfg1_programn_ls_o]

set_property IOSTANDARD LVCMOS18 [get_ports cfg1_sck0_ls_o]
set_property IOSTANDARD SSTL135  [get_ports cfg1_sck1_ls_o]
set_property IOSTANDARD SSTL135  [get_ports cfg1_sck2_ls_o]
set_property IOSTANDARD SSTL135  [get_ports cfg1_sck3_ls_o]
set_property IOSTANDARD SSTL135  [get_ports cfg1_sck4_ls_o]
set_property IOSTANDARD SSTL135  [get_ports cfg1_sck5_ls_o]
set_property IOSTANDARD SSTL135  [get_ports cfg1_sck6_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg1_miso_ls_i]
set_property IOSTANDARD LVCMOS18 [get_ports cfg1_mosi_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg1_cs0n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg1_cs1n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg1_cs2n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg1_cs3n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg1_cs4n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg1_cs5n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg1_cs6n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg1_cs_dir_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg1_programn_ls_o]


# cfg SPI for LANE 2
set_property PACKAGE_PIN M21 [get_ports cfg2_sck0_ls_o]
set_property PACKAGE_PIN U4  [get_ports cfg2_sck1_ls_o]
set_property PACKAGE_PIN T7  [get_ports cfg2_sck2_ls_o]
set_property PACKAGE_PIN T8  [get_ports cfg2_sck3_ls_o]
set_property PACKAGE_PIN P6  [get_ports cfg2_sck4_ls_o]
set_property PACKAGE_PIN P1  [get_ports cfg2_sck5_ls_o]
set_property PACKAGE_PIN M6  [get_ports cfg2_sck6_ls_o]
set_property PACKAGE_PIN N21 [get_ports cfg2_miso_ls_i]
set_property PACKAGE_PIN N19 [get_ports cfg2_mosi_ls_o]
set_property PACKAGE_PIN N22 [get_ports cfg2_cs0n_ls_o]
set_property PACKAGE_PIN P23 [get_ports cfg2_cs1n_ls_o]
set_property PACKAGE_PIN P21 [get_ports cfg2_cs2n_ls_o]
set_property PACKAGE_PIN R22 [get_ports cfg2_cs3n_ls_o]
set_property PACKAGE_PIN L22 [get_ports cfg2_cs4n_ls_o]
set_property PACKAGE_PIN M20 [get_ports cfg2_cs5n_ls_o]
set_property PACKAGE_PIN L20 [get_ports cfg2_cs6n_ls_o]
set_property PACKAGE_PIN L23 [get_ports cfg2_cs_dir_o]
set_property PACKAGE_PIN N18 [get_ports cfg2_programn_ls_o]

set_property IOSTANDARD LVCMOS18 [get_ports cfg2_sck0_ls_o]
set_property IOSTANDARD SSTL135  [get_ports cfg2_sck1_ls_o]
set_property IOSTANDARD SSTL135  [get_ports cfg2_sck2_ls_o]
set_property IOSTANDARD SSTL135  [get_ports cfg2_sck3_ls_o]
set_property IOSTANDARD SSTL135  [get_ports cfg2_sck4_ls_o]
set_property IOSTANDARD SSTL135  [get_ports cfg2_sck5_ls_o]
set_property IOSTANDARD SSTL135  [get_ports cfg2_sck6_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg2_miso_ls_i]
set_property IOSTANDARD LVCMOS18 [get_ports cfg2_mosi_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg2_cs0n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg2_cs1n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg2_cs2n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg2_cs3n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg2_cs4n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg2_cs5n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg2_cs6n_ls_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg2_cs_dir_o]
set_property IOSTANDARD LVCMOS18 [get_ports cfg2_programn_ls_o]

set_input_delay -clock lane0_sdr_clk_rl_p_i -max 4 [get_ports lane0_sdr_data_p_io[0]]
set_input_delay -clock lane0_sdr_clk_rl_p_i -max 4 [get_ports lane0_sdr_data_p_io[1]]
set_input_delay -clock lane0_sdr_clk_rl_p_i -max 4 [get_ports lane0_sdr_data_p_io[2]]
set_input_delay -clock lane0_sdr_clk_rl_p_i -max 4 [get_ports lane0_sdr_data_p_io[3]]
set_input_delay -clock lane0_sdr_clk_rl_p_i -max 4 [get_ports lane0_sdr_data_p_io[4]]
set_input_delay -clock lane0_sdr_clk_rl_p_i -max 4 [get_ports lane0_sdr_data_p_io[5]]
set_input_delay -clock lane0_sdr_clk_rl_p_i -max 4 [get_ports lane0_sdr_data_p_io[6]]
set_input_delay -clock lane0_sdr_clk_rl_p_i -max 4 [get_ports lane0_sdr_data_p_io[7]]
set_input_delay -clock lane0_sdr_clk_rl_p_i -max 4 [get_ports lane0_sdr_data_type_p_io[0]]
set_input_delay -clock lane0_sdr_clk_rl_p_i -max 4 [get_ports lane0_sdr_data_type_p_io[1]]
set_input_delay -clock clk_parallel         -max 4 [get_ports lane0_ready_io]
set_input_delay -clock clk_parallel         -max 4 [get_ports lane0_has_data_i]

set_input_delay -clock lane1_sdr_clk_rl_p_i -max 4 [get_ports lane1_sdr_data_p_io[0]]
set_input_delay -clock lane1_sdr_clk_rl_p_i -max 4 [get_ports lane1_sdr_data_p_io[1]]
set_input_delay -clock lane1_sdr_clk_rl_p_i -max 4 [get_ports lane1_sdr_data_p_io[2]]
set_input_delay -clock lane1_sdr_clk_rl_p_i -max 4 [get_ports lane1_sdr_data_p_io[3]]
set_input_delay -clock lane1_sdr_clk_rl_p_i -max 4 [get_ports lane1_sdr_data_p_io[4]]
set_input_delay -clock lane1_sdr_clk_rl_p_i -max 4 [get_ports lane1_sdr_data_p_io[5]]
set_input_delay -clock lane1_sdr_clk_rl_p_i -max 4 [get_ports lane1_sdr_data_p_io[6]]
set_input_delay -clock lane1_sdr_clk_rl_p_i -max 4 [get_ports lane1_sdr_data_p_io[7]]
set_input_delay -clock lane1_sdr_clk_rl_p_i -max 4 [get_ports lane1_sdr_data_type_p_io[0]]
set_input_delay -clock lane1_sdr_clk_rl_p_i -max 4 [get_ports lane1_sdr_data_type_p_io[1]]
set_input_delay -clock clk_parallel         -max 4 [get_ports lane1_ready_io]
set_input_delay -clock clk_parallel         -max 4 [get_ports lane1_has_data_i]

set_input_delay -clock lane2_sdr_clk_rl_p_i -max 4 [get_ports lane2_sdr_data_p_io[0]]
set_input_delay -clock lane2_sdr_clk_rl_p_i -max 4 [get_ports lane2_sdr_data_p_io[1]]
set_input_delay -clock lane2_sdr_clk_rl_p_i -max 4 [get_ports lane2_sdr_data_p_io[2]]
set_input_delay -clock lane2_sdr_clk_rl_p_i -max 4 [get_ports lane2_sdr_data_p_io[3]]
set_input_delay -clock lane2_sdr_clk_rl_p_i -max 4 [get_ports lane2_sdr_data_p_io[4]]
set_input_delay -clock lane2_sdr_clk_rl_p_i -max 4 [get_ports lane2_sdr_data_p_io[5]]
set_input_delay -clock lane2_sdr_clk_rl_p_i -max 4 [get_ports lane2_sdr_data_p_io[6]]
set_input_delay -clock lane2_sdr_clk_rl_p_i -max 4 [get_ports lane2_sdr_data_p_io[7]]
set_input_delay -clock lane2_sdr_clk_rl_p_i -max 4 [get_ports lane2_sdr_data_type_p_io[0]]
set_input_delay -clock lane2_sdr_clk_rl_p_i -max 4 [get_ports lane2_sdr_data_type_p_io[1]]
set_input_delay -clock clk_parallel         -max 4 [get_ports lane2_ready_io]
set_input_delay -clock clk_parallel         -max 4 [get_ports lane2_has_data_i]

set_input_delay -clock lane0_sdr_clk_rl_p_i -min 2 [get_ports lane0_sdr_data_p_io[0]]
set_input_delay -clock lane0_sdr_clk_rl_p_i -min 2 [get_ports lane0_sdr_data_p_io[1]]
set_input_delay -clock lane0_sdr_clk_rl_p_i -min 2 [get_ports lane0_sdr_data_p_io[2]]
set_input_delay -clock lane0_sdr_clk_rl_p_i -min 2 [get_ports lane0_sdr_data_p_io[3]]
set_input_delay -clock lane0_sdr_clk_rl_p_i -min 2 [get_ports lane0_sdr_data_p_io[4]]
set_input_delay -clock lane0_sdr_clk_rl_p_i -min 2 [get_ports lane0_sdr_data_p_io[5]]
set_input_delay -clock lane0_sdr_clk_rl_p_i -min 2 [get_ports lane0_sdr_data_p_io[6]]
set_input_delay -clock lane0_sdr_clk_rl_p_i -min 2 [get_ports lane0_sdr_data_p_io[7]]
set_input_delay -clock lane0_sdr_clk_rl_p_i -min 2 [get_ports lane0_sdr_data_type_p_io[0]]
set_input_delay -clock lane0_sdr_clk_rl_p_i -min 2 [get_ports lane0_sdr_data_type_p_io[1]]
set_input_delay -clock clk_parallel         -min 2 [get_ports lane0_ready_io]
set_input_delay -clock clk_parallel         -min 2 [get_ports lane0_has_data_i]

set_input_delay -clock lane1_sdr_clk_rl_p_i -min 2 [get_ports lane1_sdr_data_p_io[0]]
set_input_delay -clock lane1_sdr_clk_rl_p_i -min 2 [get_ports lane1_sdr_data_p_io[1]]
set_input_delay -clock lane1_sdr_clk_rl_p_i -min 2 [get_ports lane1_sdr_data_p_io[2]]
set_input_delay -clock lane1_sdr_clk_rl_p_i -min 2 [get_ports lane1_sdr_data_p_io[3]]
set_input_delay -clock lane1_sdr_clk_rl_p_i -min 2 [get_ports lane1_sdr_data_p_io[4]]
set_input_delay -clock lane1_sdr_clk_rl_p_i -min 2 [get_ports lane1_sdr_data_p_io[5]]
set_input_delay -clock lane1_sdr_clk_rl_p_i -min 2 [get_ports lane1_sdr_data_p_io[6]]
set_input_delay -clock lane1_sdr_clk_rl_p_i -min 2 [get_ports lane1_sdr_data_p_io[7]]
set_input_delay -clock lane1_sdr_clk_rl_p_i -min 2 [get_ports lane1_sdr_data_type_p_io[0]]
set_input_delay -clock lane1_sdr_clk_rl_p_i -min 2 [get_ports lane1_sdr_data_type_p_io[1]]
set_input_delay -clock clk_parallel         -min 2 [get_ports lane1_ready_io]
set_input_delay -clock clk_parallel         -min 2 [get_ports lane1_has_data_i]

set_input_delay -clock lane2_sdr_clk_rl_p_i -min 2 [get_ports lane2_sdr_data_p_io[0]]
set_input_delay -clock lane2_sdr_clk_rl_p_i -min 2 [get_ports lane2_sdr_data_p_io[1]]
set_input_delay -clock lane2_sdr_clk_rl_p_i -min 2 [get_ports lane2_sdr_data_p_io[2]]
set_input_delay -clock lane2_sdr_clk_rl_p_i -min 2 [get_ports lane2_sdr_data_p_io[3]]
set_input_delay -clock lane2_sdr_clk_rl_p_i -min 2 [get_ports lane2_sdr_data_p_io[4]]
set_input_delay -clock lane2_sdr_clk_rl_p_i -min 2 [get_ports lane2_sdr_data_p_io[5]]
set_input_delay -clock lane2_sdr_clk_rl_p_i -min 2 [get_ports lane2_sdr_data_p_io[6]]
set_input_delay -clock lane2_sdr_clk_rl_p_i -min 2 [get_ports lane2_sdr_data_p_io[7]]
set_input_delay -clock lane2_sdr_clk_rl_p_i -min 2 [get_ports lane2_sdr_data_type_p_io[0]]
set_input_delay -clock lane2_sdr_clk_rl_p_i -min 2 [get_ports lane2_sdr_data_type_p_io[1]]
set_input_delay -clock clk_parallel         -min 2 [get_ports lane2_ready_io]
set_input_delay -clock clk_parallel         -min 2 [get_ports lane2_has_data_i]

set_output_delay -clock clk_parallel -max 10 [get_ports lane0_sdr_data_p_io[0]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane0_sdr_data_p_io[1]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane0_sdr_data_p_io[2]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane0_sdr_data_p_io[3]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane0_sdr_data_p_io[4]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane0_sdr_data_p_io[5]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane0_sdr_data_p_io[6]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane0_sdr_data_p_io[7]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane0_sdr_data_type_p_io[0]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane0_sdr_data_type_p_io[1]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane0_ready_io]
set_output_delay -clock clk_parallel -max 10 [get_ports lane0_sdr_dir_o]

set_output_delay -clock clk_parallel -max 10 [get_ports lane1_sdr_data_p_io[0]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane1_sdr_data_p_io[1]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane1_sdr_data_p_io[2]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane1_sdr_data_p_io[3]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane1_sdr_data_p_io[4]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane1_sdr_data_p_io[5]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane1_sdr_data_p_io[6]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane1_sdr_data_p_io[7]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane1_sdr_data_type_p_io[0]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane1_sdr_data_type_p_io[1]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane1_ready_io]
set_output_delay -clock clk_parallel -max 10 [get_ports lane1_sdr_dir_o]

set_output_delay -clock clk_parallel -max 10 [get_ports lane2_sdr_data_p_io[0]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane2_sdr_data_p_io[1]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane2_sdr_data_p_io[2]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane2_sdr_data_p_io[3]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane2_sdr_data_p_io[4]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane2_sdr_data_p_io[5]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane2_sdr_data_p_io[6]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane2_sdr_data_p_io[7]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane2_sdr_data_type_p_io[0]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane2_sdr_data_type_p_io[1]]
set_output_delay -clock clk_parallel -max 10 [get_ports lane2_ready_io]
set_output_delay -clock clk_parallel -max 10 [get_ports lane2_sdr_dir_o]

set_output_delay -clock clk_parallel -min 2 [get_ports lane0_sdr_data_p_io[0]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane0_sdr_data_p_io[1]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane0_sdr_data_p_io[2]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane0_sdr_data_p_io[3]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane0_sdr_data_p_io[4]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane0_sdr_data_p_io[5]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane0_sdr_data_p_io[6]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane0_sdr_data_p_io[7]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane0_sdr_data_type_p_io[0]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane0_sdr_data_type_p_io[1]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane0_ready_io]
set_output_delay -clock clk_parallel -min 2 [get_ports lane0_sdr_dir_o]

set_output_delay -clock clk_parallel -min 2 [get_ports lane1_sdr_data_p_io[0]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane1_sdr_data_p_io[1]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane1_sdr_data_p_io[2]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane1_sdr_data_p_io[3]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane1_sdr_data_p_io[4]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane1_sdr_data_p_io[5]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane1_sdr_data_p_io[6]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane1_sdr_data_p_io[7]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane1_sdr_data_type_p_io[0]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane1_sdr_data_type_p_io[1]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane1_ready_io]
set_output_delay -clock clk_parallel -min 2 [get_ports lane1_sdr_dir_o]

set_output_delay -clock clk_parallel -min 2 [get_ports lane2_sdr_data_p_io[0]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane2_sdr_data_p_io[1]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane2_sdr_data_p_io[2]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane2_sdr_data_p_io[3]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane2_sdr_data_p_io[4]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane2_sdr_data_p_io[5]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane2_sdr_data_p_io[6]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane2_sdr_data_p_io[7]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane2_sdr_data_type_p_io[0]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane2_sdr_data_type_p_io[1]]
set_output_delay -clock clk_parallel -min 2 [get_ports lane2_ready_io]
set_output_delay -clock clk_parallel -min 2 [get_ports lane2_sdr_dir_o]

